cavity_mesh80/constant/momentumTransport
FoamFile
{
	format ascii;
	class dictionary;
	location "constant";
	object momentumTransport;
}

simulationType laminar;

