cavity_mesh80/constant/physicalProperties
FoamFile
{
	format ascii;
	class dictionary;
	location "constant";
	object physicalProperties;
}

viscosityModel constant;

nu 1e-05 [m^2/s];
