cavity_mesh80/system/blockMeshDict
FoamFile
{
	format ascii;
	class dictionary;	
	object blockMeshDict;
}

convertToMeters 0.1;

vertices
(
	(0 0 0)
	(1 0 0)
	(1 1 0)
	(0 1 0)

	(0 0 0.1)
	(1 0 0.1)
	(1 1 0.1)
	(0 1 0.1)
);

blocks
(
	hex (0 1 2 3 4 5 6 7) (80 80 1) simpleGrading (1 1 1)
);

boundary 
(
	movingWall
	{
		type wall;

		faces
		(
			(3 7 6 2)
		);
	}
	
	fixedWalls
	{
		type wall;

		faces
		(
			(0 4 7 3)
			(2 6 5 1)
			(1 5 4 0)
		);	
	}

	frontAndBack
	{
		type empty;

		faces
		(
			(0 3 2 1)
			(4 5 6 7)
		);
	}
); 
