cavity_mesh80/system/fvSchemes
FoamFile
{
	format ascii;
	class dictionary;
	location "system";
	object fvSchemes;
}

ddtSchemes
{
	default Euler;
}

gradSchemes
{
	default Gauss linear;
}

divSchemes
{
	default none;

	div(phi,U) Gauss limitedLinearV 1;

	div((nuEff*dev2(T(grad(U)))))
			Gauss linear;
}

laplacianSchemes
{
	default Gauss linear corrected;
}

interpolationSchemes
{
	default linear;
}

snGradSchemes
{
	default corrected;
}
